""" Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
Пример:
- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12 """

# n = [2, 3, 5, 9, 3]
# s = 0
# for i in range(len(n)):
#     if i % 2 == 1:
#         s = s+n[i]
# print(s)

""" Напишите программу, которая найдёт произведение пар чисел списка. 
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
Пример:
- [2, 3, 4, 5, 6] => [12, 15, 16]; """

# n = [2, 3, 4, 5, 6]
# list1 = []
# s = 0
# for i in (range((len(n)//2)+1)):
#     s = (n[i]*n[-i-1])
#     list1.append(s)
# print(list1)

""" Задайте список из вещественных чисел. Напишите программу, которая найдёт 
разницу между максимальным и минимальным значением дробной части элементов.
Пример:
- [1.1, 1.2, 3.1, 5, 10.01] => 0.19 """

# n = [1.1, 1.2, 3.1, 5, 10.01]
# s = 0
# b = 0
# list1 = []
# for i in range(len(n)):
#     s = n[i] % 1
#     list1.append(s)
# b = (max(list1)-min(list1))
# print("%.2f" % b)

""" Напишите программу, которая будет преобразовывать десятичное число в двоичное.
Пример:
- 45 -> 101101
- 3 -> 11 """

# n = int(input("enter number: "))
# b = []
# while (n > 0):
#     a = n % 2
#     b.append(a)
#     n = n//2
# b.reverse()
# for i in b:
#     print(i, end=" ")

""" Задайте число. Составьте список чисел Фибоначчи, 
в том числе для отрицательных индексов. """

# n = int(input("enter number: "))
# list1 = []
# list2 = []
# fib1 = fib2 = 1
# for i in range(-2, n-1):
#     fib1, fib2 = fib2, fib1 - fib2
#     list1.append(fib2)
# list1.reverse()
# fib1 = fib2 = 1
# list2.append(1)
# list2.append(1)
# for i in range(1, n-1):
#     fib1, fib2 = fib2, fib1 + fib2
#     list2.append(fib2)
# list3 = list1+list2
# print(list3, end='')
