""" Напишите программу, которая принимает на вход число N 
и выдаёт последовательность из N членов.
*Пример:*
- Для N = 5: 1, -3, 9, -27, 81 """

# print("enter N:")
# n = int(input())
# for i in range(n):
#     print((-3)**i, end = ',')

""" Для натурального n создать словарь индекс-значение, 
состоящий из элементов последовательности 3n + 1.
*Пример:*
- Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: """

# print("enter N:")
# n = int(input())
# s = {}
# for i in range(1, n+1):
#     s[i]=(3*(i)+1)
# print(s)

""" Напишите программу, в которой пользователь будет задавать две строки, 
а программа - определять количество вхождений одной строки в другой. """

# print("enter sting1:")
# a = str(input())
# print("enter sting2:")
# b = str(input())
# if (a in b):
#     print(b.count(a))
# elif (b in a):
#    print(a.count(b))

# n = int(input())
# some_dict = {}
# for i in range(1, n + 1):
# some_dict[i] = 3 * i + 1
# print(some_dict)
